tutorials/multiRegion/CHT/heatExchanger/constant/porous/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porousToAir
{
    type            interRegionHeatTransfer;

    libs            ("libinterRegionFvModels.so");

    nbrRegion       air;
    master          true;

    interpolationMethod intersection;

    semiImplicit    no;

    Av              200;

    heatTransferCoefficientModel constant;

    constantCoeffs
    {
        htc             10;
    }
}


// ************************************************************************* //
