tutorials/multiRegion/CHT/heatExchanger/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allmesh

runApplication -s air    decomposePar -region air
runApplication -s porous decomposePar -region porous

runParallel foamMultiRun

runApplication -s air    reconstructPar -latestTime -region air
runApplication -s porous reconstructPar -latestTime -region porous

#------------------------------------------------------------------------------
